# L2_C3_S7_Challenge

# 1.Data Loading

In [2]:
df=pd.read_csv('DS2_C5_S7_AllRent_Data_Challenge.csv')
df.head()

,Unnamed: 0,bathrooms,bedrooms,building_id,created,description,display_address,features,latitude,listing_id,longitude,manager_id,photos,price,street_address,interest_level
0,105408,1.0,0,0f9d07991ba14c82d3d368b72d90270a,04-04-2016 03:34,Gorgeous unit in one of the most genuinely cov...,230 Central Park South,"['Cats Allowed', 'Dogs Allowed', 'Doorman', 'E...",40.7672,6827153,-73.9802,932589de9230b697808216774fa26bd4,['https://photos.renthop.com/2/6821519_0a14cc2...,2800,230 Central Park South,high
1,110219,1.0,1,564d6f608f41e8d4a5e181c4e068e3d9,21-04-2016 20:40,Enormous 1 bedroom apartment in Murray Hill. F...,E 39th St,"['Cats Allowed', 'Dogs Allowed', 'Reduced Fee'...",40.7483,6908998,-73.9741,489ad933197469ae66acd1f7ce18f908,['https://photos.renthop.com/2/6908998_6b00895...,2100,243 E 39th St,high
2,56113,1.0,1,69790fbf0bf7e22b1d0ebc721cf0f633,14-05-2016 05:44,"This 1 bedroom, 1 bathroom spacious apartment ...",E 25th St.,"['Elevator', 'Furnished', 'Hardwood Floors']",40.7399,7013774,-73.9812,792c0f1ad1431397c65db3e69b770928,['https://photos.renthop.com/2/7013774_e7ead5d...,3000,217 E 25th St.,high
3,37765,1.0,2,d0234abbc01a982d54e8d446acc03405,05-06-2016 03:37,SPECTACULAR2 BEDROOM APARTMENT IN LUXURY 24HR ...,West 34th Street,"['Doorman', 'Elevator', 'Dishwasher', 'Hardwoo...",40.7530,7113518,-73.9958,eb5a6c4c2eb6f3e2a085c477afd5a815,['https://photos.renthop.com/2/7113518_d234153...,3000,360 West 34th Street,high
4,67397,1.0,2,a36895b9975c6991ca0fa1d9a99023a1,26-05-2016 05:36,NO FEE.. Newly Reno XL Convertible 2 Br .. Pri...,East 72nd Street,"['Dining Room', 'Doorman', 'Elevator', 'Fitnes...",40.7695,7071666,-73.9603,0a6ba20b892ed61df751420934d1ab51,['https://photos.renthop.com/2/7071666_4f81618...,3300,200 East 72nd Street,high

# 2.Data Exploration

In [3]:
df.shape

(9871, 16)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9871 entries, 0 to 9870
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       9871 non-null   int64
 1   bathrooms        9871 non-null   float64
 2   bedrooms         9871 non-null   int64
 3   building_id      9871 non-null   object
 4   created          9871 non-null   object
 5   description      9585 non-null   object
 6   display_address  9837 non-null   object
 7   features         9871 non-null   object
 8   latitude         9871 non-null   float64
 9   listing_id       9871 non-null   int64
 10  longitude        9871 non-null   float64
 11  manager_id       9871 non-null   object
 12  photos           9871 non-null   object
 13  price            9871 non-null   int64
 14  street_address   9866 non-null   object
 15  interest_level   9871 non-null   object
dtypes: float64(3), int64(4), object(9)
memory usage: 1.2+ MB

In [6]:
df.describe()

,Unnamed: 0,bathrooms,bedrooms,latitude,listing_id,longitude,price
count,9871.000000,9871.000000,9871.000000,9871.000000,9.871000e+03,9871.000000,9871.000000
mean,61828.973154,1.210617,1.533685,40.747167,7.024062e+06,-73.965549,3662.860804
std,35901.607107,0.501985,1.106696,0.414548,1.269108e+05,0.760686,2559.911997
min,9.000000,0.000000,0.000000,0.000000,6.812005e+06,-87.613400,43.000000
25%,30968.000000,1.000000,1.000000,40.727500,6.914494e+06,-73.992200,2499.000000
50%,61354.000000,1.000000,1.000000,40.750600,7.022816e+06,-73.978300,3125.000000
75%,93229.500000,1.000000,2.000000,40.773900,7.130978e+06,-73.955100,4047.500000
max,123995.000000,10.000000,8.000000,43.034600,7.742631e+06,0.000000,90000.000000

In [7]:
df.isnull().sum()

Unnamed: 0           0
bathrooms            0
bedrooms             0
building_id          0
created              0
description        286
display_address     34
features             0
latitude             0
listing_id           0
longitude            0
manager_id           0
photos               0
price                0
street_address       5
interest_level       0
dtype: int64

In [8]:
df.drop(columns=['Unnamed: 0','building_id','created','description','display_address','listing_id','manager_id','photos','street_address'],axis=1,inplace=True)

In [11]:
df.head()

,bathrooms,bedrooms,features,latitude,longitude,price,interest_level
0,1.0,0,"['Cats Allowed', 'Dogs Allowed', 'Doorman', 'E...",40.7672,-73.9802,2800,high
1,1.0,1,"['Cats Allowed', 'Dogs Allowed', 'Reduced Fee'...",40.7483,-73.9741,2100,high
2,1.0,1,"['Elevator', 'Furnished', 'Hardwood Floors']",40.7399,-73.9812,3000,high
3,1.0,2,"['Doorman', 'Elevator', 'Dishwasher', 'Hardwoo...",40.7530,-73.9958,3000,high
4,1.0,2,"['Dining Room', 'Doorman', 'Elevator', 'Fitnes...",40.7695,-73.9603,3300,high

# 3. Data Preprocessing

In [9]:
from sklearn.preprocessing import LabelEncoder
lbl=LabelEncoder()

In [27]:
df['features']=lbl.fit_transform(df['features'])
df['interest_level']=lbl.fit_transform(df['interest_level'])

In [28]:
x=df.drop(columns='interest_level')
y=df['interest_level']

In [29]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9871 entries, 0 to 9870
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   bathrooms  9871 non-null   float64
 1   bedrooms   9871 non-null   int64
 2   features   9871 non-null   int32
 3   latitude   9871 non-null   float64
 4   longitude  9871 non-null   float64
 5   price      9871 non-null   int64
dtypes: float64(3), int32(1), int64(2)
memory usage: 424.3 KB

In [30]:
y.info()

<class 'pandas.core.series.Series'>
RangeIndex: 9871 entries, 0 to 9870
Series name: interest_level
Non-Null Count  Dtype
--------------  -----
9871 non-null   int32
dtypes: int32(1)
memory usage: 38.7 KB

In [31]:
x.isnull().sum()

bathrooms    0
bedrooms     0
features     0
latitude     0
longitude    0
price        0
dtype: int64

# 4.Data Visualization

In [32]:
from tabulate import tabulate
cat=[]
con=[]
for i in df.columns:
    if df[i].nunique()>100:
        con.append(i)
    else:
        cat.append(i)
        
print(tabulate({'Categorical': cat,"Continuous": con},headers=['Categorical','Continuous']))

Categorical     Continuous
--------------  ------------
bathrooms       features
bedrooms        latitude
interest_level  longitude
                price

# Scaling

In [33]:
from sklearn.preprocessing import MinMaxScaler,StandardScaler

In [34]:
sc=StandardScaler()

In [35]:
x1=x.copy()
x2=sc.fit_transform(x1)
x=pd.DataFrame(x2,columns=x1.columns)
x.head()

   bathrooms  bedrooms  features  latitude  longitude     price
0   -0.41959 -1.385892 -1.684711  0.048326  -0.019261 -0.337084
1   -0.41959 -0.482256 -1.530574  0.002732  -0.011242 -0.610544
2   -0.41959 -0.482256 -0.225001 -0.017532  -0.020576 -0.258952
3   -0.41959  0.421379 -0.878298  0.014071  -0.039770 -0.258952
4   -0.41959  0.421379 -1.187593  0.053875   0.006901 -0.141755

# Correlation

In [36]:
corr=round(df.corr(),2)
corr

,bathrooms,bedrooms,features,latitude,longitude,price,interest_level
bathrooms,1.00,0.53,-0.02,0.01,-0.00,0.62,-0.02
bedrooms,0.53,1.00,0.01,0.02,-0.01,0.43,0.03
features,-0.02,0.01,1.00,-0.01,0.02,-0.04,-0.00
latitude,0.01,0.02,-0.01,1.00,-0.97,0.01,0.00
longitude,-0.00,-0.01,0.02,-0.97,1.00,-0.01,-0.00
price,0.62,0.43,-0.04,0.01,-0.01,1.00,-0.03
interest_level,-0.02,0.03,-0.00,0.00,-0.00,-0.03,1.00

In [37]:
corr.style.background_gradient(cmap='viridis')

In [38]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.30)

# 5.Model Building

In [53]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import AdaBoostClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.ensemble import StackingClassifier

from sklearn.model_selection import cross_val_score,KFold,RepeatedStratifiedKFold,StratifiedKFold

In [54]:
def get_stacking():
    lbl=[]
    lbl.append(('NB',GaussianNB()))
    lbl.append(('DT',DecisionTreeClassifier()))
    lbl.append(('RF',RandomForestClassifier()))
    lbl.append(('Ada',AdaBoostClassifier()))
    
    l1=LogisticRegression()
        
    model=StackingClassifier(estimators=lbl,final_estimator=l1,cv=5)
    return model

In [51]:
model_log=LogisticRegression()
model_tree=DecisionTreeClassifier()
model_random=RandomForestClassifier()
model_ADA=AdaBoostClassifier()

In [55]:
model=get_stacking()

In [56]:
model

StackingClassifier(cv=5,
                   estimators=[('NB', GaussianNB()),
                               ('DT', DecisionTreeClassifier()),
                               ('RF', RandomForestClassifier()),
                               ('Ada', AdaBoostClassifier())],
                   final_estimator=LogisticRegression())

# 6.Compare different ensemble models

# Random forest with ensamble

In [43]:
from sklearn.ensemble import RandomForestClassifier

In [48]:
rf=RandomForestClassifier()
cv=RepeatedStratifiedKFold(n_splits=10,n_repeats=3,random_state=42)
score=cross_val_score(rf,x,y,scoring='accuracy',cv=cv,n_jobs=-1)
score

array([0.69331984, 0.69503546, 0.70111449, 0.68693009, 0.70212766,
       0.71631206, 0.69604863, 0.6970618 , 0.69908815, 0.69604863,
       0.70748988, 0.69402229, 0.68794326, 0.69199595, 0.6970618 ,
       0.6899696 , 0.70010132, 0.69908815, 0.68895643, 0.70314083,
       0.70647773, 0.71225937, 0.69807497, 0.6899696 , 0.67983789,
       0.69503546, 0.69098278, 0.70921986, 0.70618034, 0.71225937])

In [49]:
score.mean()

0.6981051236930296

In [58]:
models=[model_log,model_tree,model_random,model_ADA,model]
L,T,R,A,S=[],[],[],[],[]
splits=[2,4,5,6,7,8,9,10]
for i in splits:
    cv=RepeatedStratifiedKFold(n_splits=10,n_repeats=3,random_state=8)
    for j in models:
        score=cross_val_score(j,x,y,scoring='accuracy',cv=cv,n_jobs=-1)
        if j==model_log:
            L.append(score.mean())
        elif j==model_tree:
            T.append(score.mean())
        elif j==model_random:
            R.append(score.mean())
        elif j==model_ADA:
            A.append(score.mean())
        elif j==model:
            S.append(score.mean())

In [1]:
print(L,T,R,A,S)

NameError: name 'L' is not defined

In [64]:
pd.DataFrame({'n_splits':splits,'Linear Regression':L,'Random Forest':R,'Ada boost':A},index=list(range(len(splits))))

   n_splits  Linear Regression  Random Forest  Ada boost
0         2           0.691858       0.700131   0.706919
1         4           0.691858       0.698611   0.706919
2         5           0.691858       0.698882   0.706953
3         6           0.691858       0.699119   0.706919
4         7           0.691858       0.698307   0.706919
5         8           0.691858       0.700503   0.706919
6         9           0.691858       0.698274   0.706919
7        10           0.691858       0.698442   0.706953

In [ ]:
plt.boxplot(acc,labels=name,showmeans=True)
plt.show()